import { GiCook, GiSushis, GiFruitBowl } from "react-icons/gi";
import { TbTruckDelivery } from "react-icons/tb";
export const ReviewData = [
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
];

export const BenefitData = [
  {
    icon: TbTruckDelivery,
    color: "#ec907e",
    title: "Быстрая доставка",
    mainText:
      "Кухни во всех районах города и свои курьеры обеспечивают максимальную скорость доставки",
  },
  {
    icon: GiFruitBowl,
    color: "#709f88",
    title: "Свежие продукты",
    mainText:
      "Используем для приготовления только самые качественные и свежие ингредиенты",
  },
  {
    icon: GiSushis,
    color: "#decb6a",
    title: "Акции и скидки",
    mainText: "Приятные расценки, наличие специальных акций и постояных скидок",
  },
  {
    icon: GiCook,
    color: "#8cb8e7",
    title: "Професиональное качество",
    mainText:
      "Работа с лучшими суши-мастерами и шеф-поварами, которые готовят на высшем уровне!",
  },
];
