import { Text } from "@chakra-ui/react";
import { BiSushi } from "react-icons/bi";
import { FaBurger, FaPizzaSlice } from "react-icons/fa6";
import { GiFullPizza, GiNoodles } from "react-icons/gi";
import { GiDonerKebab } from "react-icons/gi";
import { LuSoup } from "react-icons/lu";
import { GiFastNoodles } from "react-icons/gi";
import { FaBoxesStacked } from "react-icons/fa6";

import { GiCook, GiSushis, GiFruitBowl } from "react-icons/gi";
import { TbTruckDelivery } from "react-icons/tb";
import aboutImage1 from "../Assets/Image/aboutImage1.jpg";
import aboutImage2 from "../Assets/Image/aboutimage2.jpg";
import bg from "../Assets/Image/bg.jpg";
import bg2 from "../Assets/Image/bg2.jpg";
import bg3 from "../Assets/Image/bg3.jpg";
import cola from "../Assets/Image/colalogo.png";
import vilenas from "../Assets/Image/vilenas.png";
import watatsumi from "../Assets/Image/watatsumi.png";
export const ReviewData = [
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
  {
    name: "Владислава ",
    data: "13.01.2024",
    dish: "Филадельфия унаги",
    comments: "Очень вкусный сет!",
  },
];
export const PartnersData = [
  {
    image: cola,
  },
  {
    image: vilenas,
  },
  {
    image: watatsumi,
  },
];
export const BenefitData = [
  {
    icon: TbTruckDelivery,
    color: "#ec907e",
    title: "Быстрая доставка",
    mainText:
      "Кухни во всех районах города и свои курьеры обеспечивают максимальную скорость доставки",
  },
  {
    icon: GiFruitBowl,
    color: "#709f88",
    title: "Свежие продукты",
    mainText:
      "Используем для приготовления только самые качественные и свежие ингредиенты",
  },
  {
    icon: GiSushis,
    color: "#decb6a",
    title: "Акции и скидки",
    mainText: "Приятные расценки, наличие специальных акций и постояных скидок",
  },
  {
    icon: GiCook,
    color: "#8cb8e7",
    title: "Професиональное качество",
    mainText:
      "Работа с лучшими суши-мастерами и шеф-поварами, которые готовят на высшем уровне!",
  },
];
export const AboutData = [
  {
    image: aboutImage1,
    title: "Заказать суши от Burger Lord ",
    text: (
      <Text>
        Хотите приятно провести вечер или вкусно пообедать с коллегами?
        Заказывайте суши от Ролл Клаб домой или в офис. В меню нашего заведения
        вы найдете огромный выбор различных видов суши и роллов — от
        классических наименований с лососем или тунцом до оригинальных авторских
        проработок. Все блюда готовятся только из свежих ингредиентов, что
        гарантирует высокое качество и вкус каждого блюда. <br />
        <br /> Если вы хотите попробовать несколько разных видов суши, в Ролл
        Клабе есть возможность заказать специальный набор, в котором собраны
        лучшие топовые виды суши и роллов. Это отличный вариант для тех, кто
        хочет попробовать различные блюда японской кухни и оценить их вкус. На
        любимые блюда азиатской кухни у нас действуют скидки и акции, которыми
        рекомендуем воспользоваться. <br />
        <br />
        Заказать суши в Днепре можно онлайн или по телефону, не выходя из своей
        зоны комфорта. Работаем ежедневно и даже в праздники. У нас есть своя
        доставка суши в любой район Днепра.
      </Text>
    ),
  },
  {
    image: aboutImage2,
    title: "Доставка суши от Burger Lord: плюсы",
    text: (
      <Text>
        Доставка суши в Днепре — это удобный и быстрый способ получить свои
        изысканные деликатесы японской кухни прямо у себя дома или в офисе.
        Несколько плюсов, которые делают доставку суши в Днепре особенно
        выгодной:
        <br />
        <br /> Удобство и экономия времени. Не нужно тратить время на поездку в
        ресторан, выбор блюд и ожидание заказа. Все, что нужно — это выбрать
        нужные блюда в меню и сделать заказ по телефону или через интернет. Вам
        не нужно даже покидать свой дом или офис, доставка суши с доставкой по
        городу приедет к вам. Широкий выбор блюд. В Burger Lord можно найти
        огромный выбор блюд японской кухни. Вы можете выбрать любимые суши и
        роллы, а также попробовать что-то новое из меню. Качество и свежесть
        блюд. Готовим блюда только из свежих и качественных ингредиентов. Это
        гарантирует вкус каждого блюда. Доступность цен. Бесплатная доставка по
        городу. Возможность оформить заказ в любое время. <br />
        <br /> Таким образом, заказать суши на дом или в офис — это качественно,
        приятно и выгодно.
      </Text>
    ),
  },
];
export const MenuData = [
  {
    title: "Японская кухня в Днепре",
    image: bg,
    text: "Наши сушисты предлагают огромный выбор суши и роллов, которые покоряют харьковчан своим супер вкусом и внешним видом уже более 10 лет. В нашем меню суши полностью соответствуют японским традициям, а премиум роллы – американским. А еще можно попробовать суши-сеты со слабосоленым и копченым лососем, угрем и тунцом, с вкуснейшим морским окунем или икрой летучей рыбы.",
  },
  {
    title: " Меню европейской кухни",
    image: bg2,
    text: "Наша доставка предлагает вам великолепные блюда итальянской и разнообразной европейской кухни. Это конечно же пицца, пасты карбонара и с морепродуктами, шаурма, салаты с лососем, супы и многое другое. У нас есть всё для повседневного и праздничного застолья!",
  },
  {
    title: "Американские блюда",
    image: bg3,
    text: "Кто откажется от свежего и сочного бургера? Эта американская еда завоевала все континенты и страны. Вкусная котлетка с соусами и хрустящей булкой так и манит своим ароматом. Плох или хорош фаст-фуд? Об этом можно спорить долго. Но люди часто выбирают американские бургеры, потому что это — удобно, вкусно и быстро.",
  },
];
export const NavBarData = [
  {
    text: "Cуши",
    icon: GiSushis,
    router: "/sushi",
  },
  {
    text: "Роллы",
    icon: BiSushi,
    router: "/rolls",
  },
  {
    text: "Сеты",
    icon: FaBoxesStacked,
    router: "/sets",
  },
  {
    text: "Шаурма",
    icon: GiDonerKebab,
    router: "/kebab",
  },
  {
    text: "Лапша",
    icon: GiNoodles,
    router: "/noodles",
  },
  {
    text: "Супы",
    icon: LuSoup,
    router: "/soups",
  },
  {
    text: "Бургер",
    icon: FaBurger,
    router: "/burger",
  },
  {
    text: "Пицца",
    icon: FaPizzaSlice,
    router: "/pizza",
  },
];
